_wiki/2015-08-03-diff-patch-tips.html
---
collections: wiki
layout: post
title: Diff/Patch Tips
date: 2015-08-03
categories: 
-
tags: 
- diff
- patch
- tips
author: carltonf
excerpt: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Two files both added some lines, but no change in other lines</h2>
<div class="outline-text-2" id="text-1">
<p>
example:
</p>

<pre class="example">
diff -Naur index/ ~/icwiki/index/ &gt; icwiki-patch.diff
patch -Rp0 --merge &lt; ~/learnspace/git-mylife/icwiki/icwiki-patch.diff
</pre>

<p>
<b>NOTE</b>: you can <code>--dry-run</code> for previous command to see what the effect might
be, however, you are still encouraged to backup your to-be-patched files.
</p>
</div>
</div>
